app/Controllers/AdminController.php

SELECT *
FROM `users`
---
    public function user(){
        $user = new User();
        $data['users'] = $user->findAll();