app/Controllers/CategoryController.php

SELECT *
FROM `category`
---
    public function categories(){
        $cat =new Category();
        $data['categories'] = $cat->findAll();