app/Controllers/Home.php

SELECT *
FROM `category`
SELECT *
FROM `product`
---
    public function index(){

        $category = new Category();
        $data['categories'] = $category->findAll();
        $product = new Product();
        $data['products'] = $product->findAll();

SELECT *
FROM `category`
SELECT *
FROM `product`
WHERE `id` = '3'
 LIMIT 1
---
    public function productdetails($id)
    {
        helper('form');
        $category = new Category();
        $data['categories'] = $category->findAll();
        $admin = new Product();
        $data['productdetails']= $admin->where('id',$id)->first();

SELECT *
FROM `category`
SELECT *
FROM `product`
WHERE `fk_catid` = '1'
---
    public function orderlist($id)
    {  $data = [];
        $category = new Category();
        $data['categories'] = $category->findAll();

        $product = new Product();
        $data['products'] = $product->where('fk_catid',$id)->findAll();