app/Controllers/ProductController.php

INSERT INTO `product` (`product_name`, `product_des`, `qty`, `MRP`, `selling_price`, `image`, `fk_catid`) VALUES ('Purple Ceramic Upg Analog Watch - For Women NQ95061WD03', '<p>Water Resistant</p>\r\n\r\n<p>Yes</p>\r\n\r\n<p>Display Type</p>\r\n\r\n<p>Analog</p>\r\n\r\n<p>Style Code</p>\r\n\r\n<p>NQ95061WD03</p>\r\n\r\n<p>Series</p>\r\n\r\n<p>Purple Ceramic Upg</p>\r\n\r\n<p>Occasion</p>\r\n\r\n<p>Casual</p>\r\n\r\n<p>Watch Type</p>\r\n\r\n<p>Wrist Watch</p>\r\n\r\n<p>Pack of</p>\r\n\r\n<p>1</p>\r\n\r\n<p>Sales Package</p>\r\n\r\n<p>Watch/Pillow/Warranty Card/Instruction manual</p>\r\n\r\n<p>Model Name</p>\r\n\r\n<p>NQ95061WD03</p>\r\n\r\n<p>Strap Color</p>\r\n\r\n<p>Multicolor</p>\r\n\r\n<p>Net Quantity</p>\r\n\r\n<p>1</p>\r\n\r\n<p>Case/Bezel Material</p>\r\n\r\n<p>Stainless Steel</p>\r\n\r\n<p>Water Resistance Depth</p>\r\n\r\n<p>50</p>\r\n\r\n<p>Power Source</p>\r\n\r\n<p>Battery</p>\r\n\r\n<p>Dial Color</p>\r\n\r\n<p>Black</p>\r\n\r\n<p>Thickness</p>\r\n\r\n<p>39 mm</p>\r\n\r\n<p>Warranty Service Type</p>\r\n\r\n<p>Call Titan Toll free no 1800 266 0123</p>\r\n\r\n<p>Warranty Period</p>\r\n\r\n<p>2 Years</p>\r\n\r\n<p>This is daily workwear made for women with ceramic starp and this watch gives you stylish look on your hand.</p>\r\n\r\n<p>Manufacturing, Packaging and Import Info</p>\r\n', '1', '9959', '5555', '3.jpg', '3')
---
    public function products(){
        $data = [];
        helper('form');
        if($this->request->getMethod()==='POST'){
            $rules = [
                'category'      =>'required',
                'product_name'  =>'required',
                'MRP'           =>'required',
                'selling_price' =>'required',
                'qty'           =>'required',
                'product_image' =>'uploaded[product_image]|is_image[product_image]|mime_in[product_image,image/jpg,image/png,image/jpeg]|max_size[product_image,4048]',
                'description'   =>'required',
            ];

            if(!$this->validate($rules)){
                $data['validation']  = $this->validator;
            }else{
                $product  = new Product();
                $image = $this->request->getFile('product_image');
                $newImageName = $image->getClientName();
                $image->move(ROOTPATH.'public/uploads/',$newImageName);
                $data  = [
                    'product_name'=>$this->request->getVar('product_name'),
                    'product_des' =>$this->request->getVar('description'),
                    'qty'         =>$this->request->getVar('qty'),
                    'MRP'         =>$this->request->getVar('MRP'),
                    'selling_price'=>$this->request->getVar('selling_price'),
                    'image'        =>$newImageName,
                    'fk_catid'     =>$this->request->getVar('category'),
                ];
                $result = $product->save($data);

SELECT *
FROM `category`
---
        }

        $category = new Category();
        $data['categories'] = $category->findAll();

SELECT *
FROM `product`
---
    public function dashboard(){
        $product = new Product();
        $data['products'] = $product->findAll();